kamps-backend/app/controllers/camps_controller.rb

SELECT "camps".* FROM "camps"
---
  def index
    camps = Camp.all

SELECT "camps".* FROM "camps" WHERE "camps"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def show
    camp = Camp.find_by(id: params[:id])