kamps-backend/app/controllers/reviews_controller.rb

SELECT "reviews".* FROM "reviews"
---
  def index
    #@camp = Camp.find_by(id: params[:camp_id])
    reviews = Review.all

INSERT INTO "reviews" ("approve", "comment", "name", "camp_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["approve", "Yes"], ["comment", "test 1"], ["name", "Nicole "], ["camp_id", 1], ["created_at", "2020-12-30 01:23:24.927996"], ["updated_at", "2020-12-30 01:23:24.927996"]]
---
  def create
    # @camp = Camp.find_by(id: params[:camp_id])
    # @review = @camp.reviews.create(review_params)
    @review = Review.new(review_params)
    if @review.save

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 23]]
---
  def destroy
    review = Review.find(params[:id])
    review.destroy