kamps-backend/app/controllers/reviews_controller.rb

  def show
    review = Review.find_by(camp_id: params[:camp_id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."camp_id" IS NULL