kamps-backend/app/controllers/reviews_controller.rb

  def create
    if params[:camp_id]
      @camp = Camp.find_by(camp_id: params[:camp_id])
---
SELECT "camps".* FROM "camps" WHERE "camps"."camp_id" = ? LIMIT ?  [["camp_id", "3"], ["LIMIT", 1]]